Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: Pipelines containing exclusively stateless intermediate operations can be processed in a single pass, whether sequential or parallel, with minimal data buffering.
ja: 状態を持たない中間処理のみを含むパイプラインは、逐次的にも並列にも最小のバッファリングで1パスで実行できる。

source: Possibly unbounded.
ja: 上限が無い場合がある。

source: Preserving stability for {@code distinct()} in parallel pipelines is relatively expensive (requires that the operation act as a full barrier, with substantial buffering overhead), and stability is often not needed.
ja: 並列パイプラインにおいて{@code distinct()}の安定性を保つのは比較的コストが高く(この処理がフルバリアとして働き、相当なバッファリングのオーバーヘッドを伴う)、多くの場合安定性は必要ない。

source: Processing elements with an explicit {@code for-}loop is inherently serial.
ja: 明示的な{@ for}ループによる要素の処理は本質的に逐次的である。

source: Processing streams lazily allows for significant efficiencies; in a pipeline such as the filter-map-sum example above, filtering, mapping, and summing can be fused into a single pass on the data, with minimal intermediate state.
ja: ストリームを遅延的に処理すると大幅な効率化が可能となる。上記の絞り込み・写像・合計の例などのパイプラインでは、絞り込み・写像・合計はデータに対する1回のパスに融合でき、中間データも最小にできる。

source: R r1 = finisher.apply(a1); // result without splitting
ja: R r1 = finisher.apply(a1); // 分割しない場合の結果

source: R r2 = finisher.apply(combiner.apply(a2, a3)); // result with splitting }
ja: R r2 = finisher.apply(combiner.apply(a2, a3)); // 分割した場合の結果 }

source: Reduction operations
ja: 簡約処理

source: Reduction operations can be performed either sequentially or in parallel.
ja: 簡約処理は逐次的にも並列にも処理できる。

source: Reduction parallellizes well because the implementation can operate on subsets of the data in parallel, and then combine the intermediate results to get the final correct answer.
ja: 簡約の実装はデータの各部分を並列に処理し、中間結果を統合して最終的な正しい答えを得られるため、簡約は上手く並列化できる

source: Reduction, concurrency, and ordering
ja: 簡約と並行性と順序

source: Returns a builder for a {@code DoubleStream}.
ja: {@code DoubleStream}のビルダを返す。

source: Returns a builder for a {@code LongStream}.
ja: {@code LongStream}のビルダを返す。

source: Returns a builder for a {@code Stream}.
ja: {@code Stream}のビルダを返す。

source: Returns a builder for an {@code IntStream}.
ja: {@code IntStream}のビルダを返す。

source: Returns a concurrent {@code Collector} implementing a "group by" operation on input elements of type {@code T}, grouping elements according to a classification function.
ja: {@code T}型である入力要素に対する"group by"処理を実装する並行{@code Collector}を返す。つまり要素を分類関数に従ってグループ化する{@code Collector}を返す。

source: Returns a concurrent {@code Collector} implementing a cascaded "group by" operation on input elements of type {@code T}, grouping elements according to a classification function, and then performing a reduction operation on the values associated with a given key using the specified downstream {@code Collector}.
ja: {@code T}型である入力要素に対するカスケードされた"group by"処理を実装する並行{@code Collector}を返す。つまり要素を分類関数に従ってグループ化した後に下流の{@code Collector}を使って与えられたキーに対応する値の簡約処理を実行する{@code Collector}を返す。

source: Returns a concurrent {@code Collector} that accumulates elements into a {@code ConcurrentMap} whose keys and values are the result of applying the provided mapping functions to the input elements.
ja: 写像関数の結果をキーと値として、要素を{@code ConcurrentMap}に累積する並行{@code Collector}を返す。

source: Returns a new {@code Collector} described by the given {@code supplier}, {@code accumulator}, and {@code combiner} functions.
ja: 与えられた関数{@code supplier}, {@code accumulator}, {@code combiner}によって表わされる新しい{@code Collector}を返す。

source: Returns a new {@code Collector} described by the given {@code supplier}, {@code accumulator}, {@code combiner}, and {@code finisher} functions.
ja: 与えられた{@code supplier}, {@code accumulator}, {@code combiner}, {@code finisher}によって表わされる新しい{@code Collector}を返す。

source: Returns a sequential ordered stream whose elements are the specified values.
ja: 要素が指定された値であるような逐次的なストリームを返す。

source: Returns a sequential ordered {@code IntStream} from {@code startInclusive} (inclusive) to {@code endExclusive} (exclusive) by an incremental step of {@code 1}.
ja: {@code startInclusive}(この値を含む)から{@code endExclusive}(この値を含まない)まで、{@code 1}ずつ増加する順序を持つ逐次的な{@code IntStream}を返す。

source: Returns a sequential ordered {@code IntStream} from {@code startInclusive} (inclusive) to {@code endInclusive} (inclusive) by an incremental step of {@code 1}.
ja: {@code startInclusive}(この値を含む)から{@code endInclusive}(この値を含む)まで、{@code 1}ずつ増加する順序を持つ逐次的な{@code IntStream}を返す。

source: Returns a sequential ordered {@code LongStream} from {@code startInclusive} (inclusive) to {@code endExclusive} (exclusive) by an incremental step of {@code 1}.
ja: {@code startInclusive}(この値を含む)から{@code endExclusive}(この値を含まない)まで、{@code 1}ずつ増加する順序を持つ逐次的な{@code LongStream}を返す。

source: Returns a sequential ordered {@code LongStream} from {@code startInclusive} (inclusive) to {@code endInclusive} (inclusive) by an incremental step of {@code 1}.
ja: {@code startInclusive}(この値を含む)から{@code endInclusive}(この値を含む)まで、{@code 1}ずつ増加する順序を持つ逐次的な{@code LongStream}を返す。

source: Returns a sequential {@code IntStream} containing a single element.
ja: 1つの要素を含む逐次的な{@code IntStream}を返す。

source: Returns a sequential {@code LongStream} containing a single element.
ja: 1つの要素を含む逐次的な{@code LongStream}を返す。

source: Returns a sequential {@code Stream} containing a single element.
ja: 1つの要素を含む逐次的な{@code Stream}を返す。

source: Returns a spliterator for the elements of this stream.
ja: このストリームの要素のスプリッテレータを返す。

source: Returns a stream consisting of the distinct elements (according to {@link Object#equals(Object)}) of this stream.
ja: このストリームの要素のうち({@link Object#equals(Object)}に従って)重複を除いた要素からなるストリームを返す。

source: Returns a stream consisting of the distinct elements of this stream.
ja: このストリームの要素のうち重複を除いた要素からなるストリームを返す。

source: Returns a stream consisting of the elements of this stream in sorted order.
ja: このストリームの要素を、整列した結果からなるストリームを返す。

source: Returns a stream consisting of the elements of this stream that match the given predicate.
ja: このストリームの要素のうち、与えられた述語に適合する要素からなるストリームを返す。

source: Returns a stream consisting of the elements of this stream, additionally performing the provided action on each element as elements are consumed from the resulting stream.
ja: このストリームの要素からなり、加えて結果のストリームから要素が消費されるごとにその要素にアクションを実行するストリームを返す。

source: Returns a stream consisting of the elements of this stream, sorted according to natural order.
ja: このストリームの要素を、自然順に整列した結果からなるストリームを返す。

source: Returns a stream consisting of the elements of this stream, sorted according to the provided {@code Comparator}.
ja: このストリームの要素を、与えらえた{@code Comparator}に従って整列した結果からなるストリームを返す。

source: Returns a stream consisting of the elements of this stream, truncated to be no longer than {@code maxSize} in length.
ja: このストリームの要素からなり、長さが{@code maxSize}より長くならないように切り詰められたストリームを返す。

source: Returns a stream consisting of the remaining elements of this stream after discarding the first {@code n} elements of the stream.
ja: このストリームの{@code n}個の要素を取り除いた残りの要素からなるストリームを返す。

source: Returns a stream consisting of the results of applying the given function to the elements of this stream.
ja: このストリームの要素に与えられた関数を適用した結果からなるストリームを返す。

source: Returns a stream consisting of the results of replacing each element of this stream with the contents of a mapped stream produced by applying the provided mapping function to each element.
ja: 与えられた写像関数をこのストリームの各要素に適用して生成したストリームの内容で各要素を置き換えた結果からなるストリームを返す。

source: Returns a {@code Collector} accepting elements of type {@code T} that counts the number of input elements.
ja: {@code T}型の要素を受け入れ、l入力要素数を数える{@code Collector}を返す。

source: Returns a {@code Collector} implementing a "group by" operation on input elements of type {@code T}, grouping elements according to a classification function, and returning the results in a {@code Map}.
ja: {@code T}型である入力要素に対する"group by"処理を実装する{@code Collector}を返す。つまり要素を分類関数に従ってグループ化して結果を{@code Map}で返す{@code Collector}を返す。

source: Returns a {@code Collector} implementing a cascaded "group by" operation on input elements of type {@code T}, grouping elements according to a classification function, and then performing a reduction operation on the values associated with a given key using the specified downstream {@code Collector}.
ja: {@code T}型である入力要素に対するカスケードされた"group by"処理を実装する{@code Collector}を返す。つまり要素を分類関数に従ってグループ化した後に下流の{@code Collector}を使って与えられたキーに対応する値の簡約処理を実行する{@code Collector}を返す。

source: Returns a {@code Collector} that accumulates elements into a {@code Map} whose keys and values are the result of applying the provided mapping functions to the input elements.
ja: 写像関数の結果をキーと値として、要素を{@code Map}に累積する{@code Collector}を返す。

source: Returns a {@code Collector} that accumulates the input elements into a new {@code Collection}, in encounter order.
ja: 入力要素を新しい{@code Collection}に出現順に累積する{@code Collector}を返す。

source: Returns a {@code Collector} that accumulates the input elements into a new {@code List}.
ja: 入力要素を新しい{@code List}に出現順に累積する{@code Collector}を返す。

source: Returns a {@code Collector} that accumulates the input elements into a new {@code Set}.
ja: 入力要素を新しい{@code Set}に出現順に累積する{@code Collector}を返す。

source: Returns a {@code Collector} that concatenates the input elements into a {@code String}, in encounter order.
ja: 入力要素を出現順に{@link String}に連結する{@code Collector}を返す。

source: Returns a {@code Collector} that concatenates the input elements, separated by the specified delimiter, in encounter order.
ja: 入力要素を出現順に指定された文字列で区切って{@link String}に連結する{@code Collector}を返す。

source: Returns a {@code Collector} that concatenates the input elements, separated by the specified delimiter, with the specified prefix and suffix, in encounter order.
ja: 入力要素を出現順に指定された文字列で区切って連結し、指定された接頭辞および接尾辞を付与する{@code Collector}を返す。

source: Returns a {@code Collector} that produces the arithmetic mean of a double-valued function applied to the input elements.
ja: double値を返す関数を入力要素に適用した結果の算術平均を返す{@code Collector}を返す。

source: Returns a {@code Collector} that produces the arithmetic mean of a long-valued function applied to the input elements.
ja: long値を返す関数を入力要素に適用した結果の算術平均を返す{@code Collector}を返す。

source: Returns a {@code Collector} that produces the arithmetic mean of an integer-valued function applied to the input elements.
ja: int値を返す関数を入力要素に適用した結果の算術平均を返す{@code Collector}を返す。

source: Returns a {@code Collector} that produces the maximal element according to a given {@code Comparator}, described as an {@code Optional<T>}.
ja: 与えられた{@code Comparator}に従って最大の要素を表す{@code Optional<T>}を生成する{@code Collector<T, T>}を返す。

source: Returns a {@code Collector} that produces the minimal element according to a given {@code Comparator}, described as an {@code Optional<T>}.
ja: 与えられた{@code Comparator}に従って最小の要素を表す{@code Optional<T>}を生成する{@code Collector<T, T>}を返す。

source: Returns a {@code Collector} that produces the sum of a double-valued function applied to the input elements.
ja: double値を返す関数を入力要素に適用した結果の和を返す{@code Collector}を返す。

source: Returns a {@code Collector} that produces the sum of a integer-valued function applied to the input elements.
ja: int値を返す関数を入力要素に適用した結果の和を返す{@code Collector}を返す。

source: Returns a {@code Collector} that produces the sum of a long-valued function applied to the input elements.
ja: long値を返す関数を入力要素に適用した結果の和を返す{@code Collector}を返す。

source: Returns a {@code Collector} which applies an {@code double}-producing mapping function to each input element, and returns summary statistics for the resulting values.
ja: 各入力要素に{@code double}を返す関数を適用し、結果の値に対する要約統計量を返す{@code Collector}を返す。

source: Returns a {@code Collector} which applies an {@code int}-producing mapping function to each input element, and returns summary statistics for the resulting values.
ja: 各入力要素に{@code int}を返す関数を適用し、結果の値に対する要約統計量を返す{@code Collector}を返す。

source: Returns a {@code Collector} which applies an {@code long}-producing mapping function to each input element, and returns summary statistics for the resulting values.
ja: 各入力要素に{@code long}を返す関数を適用し、結果の値に対する要約統計量を返す{@code Collector}を返す。

source: Returns a {@code Collector} which partitions the input elements according to a {@code Predicate}, and organizes them into a {@code Map<Boolean, List<T>>}.
ja: 入力要素を{@code Predicate}に従って分割して{@code Map<Boolean, List<T>>}に編成する{@code Collector}を返す。

source: Returns a {@code Collector} which partitions the input elements according to a {@code Predicate}, reduces the values in each partition according to another {@code Collector}, and organizes them into a {@code Map<Boolean, D>} whose values are the result of the downstream reduction.
ja: 入力要素を{@code Predicate}に従って分割した後に他の{@code Collector}を使って各パーティションの値を簡約して、簡約結果を値とする{@code Map<Boolean, D>}に編成する{@code Collector}を返す。

source: Returns a {@code Collector} which performs a reduction of its input elements under a specified mapping function and {@code BinaryOperator}.
ja: 指定された写像関数と{@code BinaryOperator}に基いて入力要素の簡約を実行する{@code Collector}を返す。

source: Returns a {@code Collector} which performs a reduction of its input elements under a specified {@code BinaryOperator} using the provided identity.
ja: 与えられた単位元を使い、指定された{@code BinaryOperator}に基いて入力要素の簡約を実行する{@code Collector}を返す。

source: Returns a {@code Collector} which performs a reduction of its input elements under a specified {@code BinaryOperator}.
ja: 指定された{@code BinaryOperator}に基づいて入力要素の簡約を実行する{@code Collector}を返す。

source: Returns a {@code DoubleStream} consisting of the elements of this stream, converted to {@code double}.
ja: このストリームの要素を{@code double}に変換した要素からなる{@code DoubleStream}を返す。

source: Returns a {@code DoubleStream} consisting of the results of applying the given function to the elements of this stream.
ja: このストリームの要素に与えられた関数を適用した結果からなる{@code DoubleStream}を返す。

source: Returns a {@code DoubleSummaryStatistics} describing various summary data about the elements of this stream.
ja: このストリームの要素の各種概要情報を表す{@code DoubleSummaryStatistics}を返す。

source: Returns a {@code LongStream} consisting of the elements of this stream, converted to {@code long}.
ja: このストリームの要素を{@code long}に変換した要素からなる{@code LongStream}を返す。

source: Returns a {@code LongStream} consisting of the results of applying the given function to the elements of this stream.
ja: このストリームの要素に与えられた関数を適用した結果からなる{@code LongStream}を返す。

source: Returns a {@code LongSummaryStatistics} describing various summary data about the elements of this stream.
ja: このストリームの要素の各種概要情報を表す{@code LongSummaryStatistics}を返す。

source: Returns a {@code Set} of {@code Collector.Characteristics} indicating the characteristics of this Collector.
ja: このCollectorの特性を示す{@code Collector.Characteristics}の{@code Set}を返す。

source: Returns a {@code Stream} consisting of the elements of this stream, boxed to {@code Double}.
ja: このストリームの要素を{@code Double}にボックス化した要素からなる{@code Stream}を返す。

source: Returns a {@code Stream} consisting of the elements of this stream, each boxed to a {@code Long}.
ja: このストリームの要素を{@code Long}にボックス化した要素からなる{@code Stream}を返す。

source: Returns a {@code Stream} consisting of the elements of this stream, each boxed to an {@code Integer}.
ja: このストリームの要素を{@code Integer}にボックス化した要素からなる{@code Stream}を返す。

source: Returns an array containing the elements of this stream, using the provided {@code generator} function to allocate the returned array, as well as any additional arrays that might be required for a partitioned execution or for resizing.
ja: このストリームの要素からなる配列を返す。与えられた{@code generator}関数を使って返り値の配列や、分割実行やリサイズ時に必要となる配列を確保する。

source: Returns an array containing the elements of this stream.
ja: このストリームの要素からなる配列を返す。

source: Returns an empty sequential {@code DoubleStream}.
ja: 空の逐次的{@code DoubleStream}を返す。

source: Returns an empty sequential {@code IntStream}.
ja: 空の逐次的{@code IntStream}を返す。

source: Returns an empty sequential {@code LongStream}.
ja: 空の逐次的{@code LongStream}を返す。

source: Returns an empty sequential {@code Stream}.
ja: 空の逐次的{@code Stream}を返す。

source: Returns an equivalent stream that is unordered.
ja: 順序を持たず同等なストリームを返す。

source: Returns an equivalent stream that is parallel.
ja: 並列であり同等なストリームを返す。

source: Returns an equivalent stream that is sequential.
ja: 逐次的であり同等なストリームを返す。

source: Returns an equivalent stream with an additional close handler.
ja: ストリームを閉じる追加のハンドラを伴う等価なストリームを返す。

source: Returns an infinite sequential ordered {@code DoubleStream} produced by iterative application of a function {@code f} to an initial element {@code seed}, producing a {@code Stream} consisting of {@code seed}, {@code f(seed)}, {@code f(f(seed))}, etc.
ja: 初期要素{@code seed}に対する関数{@code f}の繰り返しの適用によって生成された無限{@code DoubleStream}を返す。{@code seed}, {@code f(seed)}, {@code f(f(seed))}などからなる{@code LongStream}を生成する。

source: Returns an infinite sequential ordered {@code IntStream} produced by iterative application of a function {@code f} to an initial element {@code seed}, producing a {@code Stream} consisting of {@code seed}, {@code f(seed)}, {@code f(f(seed))}, etc.
ja: 初期要素{@code seed}に対する関数{@code f}の繰り返しの適用によって生成された無限{@code IntStream}を返す。{@code seed}, {@code f(seed)}, {@code f(f(seed))}などからなる{@code LongStream}を生成する。

source: Returns an infinite sequential ordered {@code LongStream} produced by iterative application of a function {@code f} to an initial element {@code seed}, producing a {@code Stream} consisting of {@code seed}, {@code f(seed)}, {@code f(f(seed))}, etc.
ja: 初期要素{@code seed}に対する関数{@code f}の繰り返しの適用によって生成された無限{@code LongStream}を返す。{@code seed}, {@code f(seed)}, {@code f(f(seed))}などからなる{@code LongStream}を生成する。

source: Returns an infinite sequential ordered {@code Stream} produced by iterative application of a function {@code f} to an initial element {@code seed}, producing a {@code Stream} consisting of {@code seed}, {@code f(seed)}, {@code f(f(seed))}, etc.
ja: 初期要素{@code seed}に対する関数{@code f}の繰り返しの適用によって生成された無限{@code Stream}を返す。{@code seed}, {@code f(seed)}, {@code f(f(seed))}などからなるストームを生成する。

source: Returns an infinite sequential unordered stream where each element is generated by the provided {@code DoubleSupplier}.
ja: 各要素が{@code DoubleSupplier}によって生成される、逐次的な無限{@code Stream}を返す。

source: Returns an infinite sequential unordered stream where each element is generated by the provided {@code IntSupplier}.
ja: 各要素が{@code IntSupplier}によって生成される、逐次的な無限ストリームを返す。

source: Returns an infinite sequential unordered stream where each element is generated by the provided {@code LongSupplier}.
ja: 各要素が{@code LongSupplier}によって生成される、逐次的な無限ストリームを返す。

source: Returns an infinite sequential unordered stream where each element is generated by the provided {@code Supplier}.
ja: 各要素が{@code Supplier}によって生成される、逐次的な無限{@code Stream}を返す。

source: Returns an iterator for the elements of this stream.
ja: このストリームの要素のイテレータを返す。

source: Returns an object-valued {@code Stream} consisting of the results of applying the given function to the elements of this stream.
ja: このストリームの要素に与えられた関数を適用した結果からなる、オブジェクトを値として持つ{@code Stream}を返す。

source: Returns an {@code DoubleStream} consisting of the results of replacing each element of this stream with the contents of a mapped stream produced by applying the provided mapping function to each element.
ja: 与えられた写像関数をこのストリームの各要素に適用して生成したストリームの内容で各要素を置き換えた結果からなる{@code DoubleStream}を返す。

source: Returns an {@code IntStream} consisting of the results of applying the given function to the elements of this stream.
ja: このストリームの要素に与えられた関数を適用した結果からなる{@code IntStream}を返す。

source: Returns an {@code IntStream} consisting of the results of replacing each element of this stream with the contents of a mapped stream produced by applying the provided mapping function to each element.
ja: 与えられた写像関数をこのストリームの各要素に適用して生成したストリームの内容で各要素を置き換えた結果からなる{@code IntStream}を返す。

source: Returns an {@code IntSummaryStatistics} describing various summary data about the elements of this stream.
ja: このストリームの要素の各種概要情報を表す{@code IntSummaryStatistics}を返す。

source: Returns an {@code LongStream} consisting of the results of replacing each element of this stream with the contents of a mapped stream produced by applying the provided mapping function to each element.
ja: 与えられた写像関数をこのストリームの各要素に適用して生成したストリームの内容で各要素を置き換えた結果からなる{@code LongStream}を返す。

source: Returns an {@code OptionalDouble} describing the arithmetic mean of elements of this stream, or an empty optional if this stream is empty.
ja: このストリームの算術平均を表す{@code OptionalDouble}、またはこのストリームが空ならば空の{@code OptionalDouble}

source: Returns an {@code OptionalDouble} describing the maximum element of this stream, or an empty OptionalDouble if this stream is empty.
ja: このストリームの最大要素を表す{@code OptionalDouble}、またはこのストリームが空ならば空の{@code OptionalDouble}

source: Returns an {@code OptionalDouble} describing the minimum element of this stream, or an empty OptionalDouble if this stream is empty.
ja: このストリームの最小要素を表す{@code OptionalDouble}、またはこのストリームが空ならば空の{@code OptionalDouble}

source: Returns an {@code OptionalInt} describing the maximum element of this stream, or an empty optional if this stream is empty.
ja: このストリームの最大要素を表す{@code OptionalInt}、またはこのストリームが空ならば空の{@code OptionalInt}

source: Returns an {@code OptionalInt} describing the minimum element of this stream, or an empty optional if this stream is empty.
ja: このストリームの最小要素を表す{@code OptionalInt}、またはこのストリームが空ならば空の{@code OptionalInt}

source: Returns an {@code OptionalLong} describing the maximum element of this stream, or an empty optional if this stream is empty.
ja: このストリームの最大要素を表す{@code OptionalLong}、またはこのストリームが空ならば空の{@code OptionalLong}

source: Returns an {@code OptionalLong} describing the minimum element of this stream, or an empty optional if this stream is empty.
ja: このストリームの最小要素を表す{@code OptionalLong}、またはこのストリームが空ならば空の{@code OptionalLong}

source: Returns an {@link OptionalDouble} describing some element of the stream, or an empty {@code OptionalDouble} if the stream is empty.
ja: このストリームのある要素を表す{@link OptionalDouble}、もしくはストリームが空であれば空の{@code OptionalDouble}を返す。

source: Returns an {@link OptionalDouble} describing the first element of this stream, or an empty {@code OptionalDouble} if the stream is empty.
ja: このストリームの最初の要素を表す{@link OptionalDouble}、もしくはストリームが空であれば空の{@code OptionalDouble}を返す。

source: Returns an {@link OptionalInt} describing some element of the stream, or an empty {@code OptionalInt} if the stream is empty.
ja: このストリームのある要素を表す{@link OptionalInt}、もしくはストリームが空であれば空の{@code OptionalInt}を返す。

source: Returns an {@link OptionalInt} describing the first element of this stream, or an empty {@code OptionalInt} if the stream is empty.
ja: このストリームの最初の要素を表す{@link OptionalInt}、もしくはストリームが空であれば空の{@code OptionalInt}を返す。

source: Returns an {@link OptionalLong} describing some element of the stream, or an empty {@code OptionalLong} if the stream is empty.
ja: このストリームのある要素を表す{@link OptionalLong}、もしくはストリームが空であれば空の{@code OptionalLong}を返す。

source: Returns an {@link OptionalLong} describing the first element of this stream, or an empty {@code OptionalLong} if the stream is empty.
ja: このストリームの最初の要素を表す{@link OptionalLong}、もしくはストリームが空であれば空の{@code OptionalLong}を返す。

source: Returns an {@link Optional} describing some element of the stream, or an empty {@code Optional} if the stream is empty.
ja: このストリームのある要素を表す{@link Optional}、もしくはストリームが空であれば空の{@code Optional}を返す。

source: Returns an {@link Optional} describing the first element of this stream, or an empty {@code Optional} if the stream is empty.
ja: このストリームの最初の要素を表す{@link Optional}、もしくはストリームが空であれば空の{@code Optional}を返す。

source: Returns the count of elements in this stream.
ja: このストリームの要素数を返す。

source: Returns the maximum element of this stream according to the provided {@code Comparator}.
ja: このストリームの最大要素を{@code Comparator}に従って返す。

source: Returns the minimum element of this stream according to the provided {@code Comparator}.
ja: このストリームの最小要素を{@code Comparator}に従って返す。

source: Returns the sum of elements in this stream.
ja: このストリームの要素の和を返す。

source: Returns whether all elements of this stream match the provided predicate.
ja: このストリームの全ての要素が与えられた述語に適合するか返す。
